In [3]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.29-cp37-cp37m-win_amd64.whl (7.7 MB)
Collecting protobuf>=3.0.0
  Downloading protobuf-4.21.2-cp37-cp37m-win_amd64.whl (524 kB)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.0.29 protobuf-4.21.2
Note: you may need to restart the kernel to use updated packages.

# - Exercici 1:

A partir dels documents adjunts (estructura i dades), crea una base de dades amb MySQL. Mostra les característiques principals de l'esquema creat i explica les diferents taules i variables que hi ha.

In [ ]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="123456"
)

In [34]:
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)

('basedades1',)
('information_schema',)
('movies',)
('mysql',)
('performance_schema',)
('sakila',)
('sgae_practica',)
('sys',)
('world',)

In [35]:
mycursor = mydb.cursor()

In [ ]:
mycursor.execute("CREATE DATABASE SGAE_Practica")

In [11]:
mycursor.execute("CREATE SCHEMA movies")

In [13]:
mycursor.execute("CREATE TABLE movies.tb_genre (  genre_id  INTEGER NOT NULL ,  genre_name   CHARACTER VARYING(40) NOT NULL ,  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,  created_date     DATE ,  updated_date     DATE ,  CONSTRAINT pk_genre PRIMARY KEY (genre_id))")

In [14]:
mycursor.execute("CREATE TABLE movies.tb_movie (  movie_id         INTEGER NOT NULL ,  movie_title      CHARACTER VARYING(100) NOT NULL ,  movie_date       DATE ,  movie_format     CHARACTER VARYING(50) ,  movie_genre_id   INTEGER ,  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,  created_date     DATE ,  updated_date     DATE ,  CONSTRAINT pk_movie PRIMARY KEY (movie_id) ,  CONSTRAINT fk_movie_genre FOREIGN KEY (movie_genre_id) REFERENCES movies.tb_genre (genre_id))")

In [15]:
mycursor.execute("CREATE TABLE movies.tb_role (  role_id          INTEGER NOT NULL ,  role_name        CHARACTER VARYING(60) NOT NULL ,  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,  created_date     DATE ,  updated_date     DATE ,  CONSTRAINT pk_role PRIMARY KEY (role_id))")

In [16]:
mycursor.execute("CREATE TABLE movies.tb_person (  person_id        INTEGER NOT NULL ,  person_name      CHARACTER VARYING(100) NOT NULL ,  person_country   CHARACTER VARYING(40) ,  person_dob       DATE NOT NULL ,  person_dod       DATE ,  person_parent_id INTEGER ,  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,  created_date     DATE ,  updated_date     DATE ,  CONSTRAINT pk_person PRIMARY KEY (person_id) ,  CONSTRAINT fk_person_parent FOREIGN KEY (person_parent_id) REFERENCES movies.tb_person (person_id))")

In [17]:
mycursor.execute("CREATE TABLE movies.tb_movie_person (  movie_id         INTEGER NOT NULL ,  person_id        INTEGER NOT NULL ,  role_id         INTEGER NOT NULL ,  movie_award_ind  CHAR(1) NOT NULL ,  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,  created_date     DATE ,  updated_date     DATE ,  CONSTRAINT pk_movper PRIMARY KEY (movie_id, person_id, role_id) ,  CONSTRAINT fk_movper_movie FOREIGN KEY (movie_id) REFERENCES movies.tb_movie (movie_id) ,  CONSTRAINT fk_movper_person FOREIGN KEY (person_id) REFERENCES movies.tb_person (person_id) ,  CONSTRAINT fk_movper_role FOREIGN KEY (role_id) REFERENCES movies.tb_role (role_id))")

In [21]:
mycursor.execute("COMMIT")

In [54]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="123456",
  database="SGAE_Practica"
)
mycursor = mydb.cursor()

In [55]:
sql = "INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user, created_date, updated_date) VALUES ( %s, %s, %s, %s, %s)"
val = [
  (1, 'Acción'),
  (2, 'Ciencia Ficción'),
  (3, 'Comedia'),
  (4, 'Drama'),
  (5, 'Fantasía', 'apermag'),
  (6, 'Melodrama', 'apermag','2018-09-01', '2018-09-27'),
  (7, 'Musical'),
  (8, 'Romance'),
  (9, 'Suspense'),
  (10, 'Terror'),
  (11, 'Bélico')
]

mycursor.executemany(sql, val)
mycursor.commit()

InterfaceError: Failed executing the operation; Not enough parameters for the SQL statement

In [68]:
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 1, 'Acción')")
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 2, 'Ciencia Ficción')")
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 3, 'Comedia')")
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 4, 'Drama')")
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user) VALUES ( 5, 'Fantasía', 'apermag')")
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user, created_date, updated_date) VALUES ( 6, 'Melodrama', 'apermag', '2018-09-01', '2018-09-27')")
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 7, 'Musical')")
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 8, 'Romance')")
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 9, 'Suspense')")
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 10, 'Terror')")
mycursor.execute("INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 11, 'Bélico')")

In [ ]:
print(mycursor.rowcount, "was inserted.")

In [71]:
mycursor.execute("SELECT * FROM movies.tb_genre")

In [72]:
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 'Acción', 'OS_SGAD', None, None)
(2, 'Ciencia Ficción', 'OS_SGAD', None, None)
(3, 'Comedia', 'OS_SGAD', None, None)
(4, 'Drama', 'OS_SGAD', None, None)
(5, 'Fantasía', 'apermag', None, None)
(6, 'Melodrama', 'apermag', datetime.date(2018, 9, 1), datetime.date(2018, 9, 27))
(7, 'Musical', 'OS_SGAD', None, None)
(8, 'Romance', 'OS_SGAD', None, None)
(9, 'Suspense', 'OS_SGAD', None, None)
(10, 'Terror', 'OS_SGAD', None, None)
(11, 'Bélico', 'OS_SGAD', None, None)

In [74]:
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 1, 'Apocalypse Now', '1979-05-10', 'Film', 11)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 2, 'Star Wars:Episode IV - A New Hope', '1977-05-25', 'Film', 2)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 3, 'Indiana Jones and the Temple of Doom', '1984-05-08', 'Film', 1)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 4, 'The Terminal', '2004-06-18', 'Digital', 3)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 5, 'Jaws', '1975-01-01', 'Film', 10)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 6, 'ET The Extraterrestrial', '1982-07-25', 'Film', 5)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 7, 'Psycho', '1960-05-06', 'Film', 9)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 8, 'Ocho Apellidos Vascos', '2014-03-14', 'Digital', 3)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 9, 'Ocho Apellidos Catalanes', '2016-06-09', 'Digital', 8)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (10, 'El otro lado de la cama', '2002-09-04', 'Digital', 8)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (11, 'La Gran Familia Española', '2012-10-15', 'Digital', 3)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (12, 'El dia de la bestia', '1994-12-25', 'Film', 1)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (13, 'Braveheart', '1995-08-08', 'Film', 4)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (14, 'The Shawshank Redemption', '1992-01-07', 'Film', 4)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (15, 'Las brujas de Zugarramurdi', '2009-10-07', 'Digital', 9)")
mycursor.execute("INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (16, 'Blade Runner', '1982-12-25', 'Digital', 2)")

In [75]:
mycursor.execute("SELECT * FROM movies.tb_movie")
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 8, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(11, 'La Gran Familia Española', datetime.date(2012, 10, 15), 'Digital', 3, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)

In [76]:
mycursor.execute("INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 1, 'Actor')")
mycursor.execute("INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 2, 'Director')")
mycursor.execute("INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 3, 'Productor')")
mycursor.execute("INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 4, 'Guionista')")
mycursor.execute("INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 5, 'Música')")

In [77]:
mycursor.execute("SELECT * FROM movies.tb_role")
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 'Actor', 'OS_SGAD', None, None)
(2, 'Director', 'OS_SGAD', None, None)
(3, 'Productor', 'OS_SGAD', None, None)
(4, 'Guionista', 'OS_SGAD', None, None)
(5, 'Música', 'OS_SGAD', None, None)

In [78]:
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 1, 'Francis Ford Coppola', 'United States', '1939-04-07', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 2, 'Carmine Coppola', 'United States', '1945-07-08', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 3, 'Marlon Brando', 'United States', '1924-04-03', '2004-07-01', NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 4, 'Robert Duvall', 'United States', '1931-01-05', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 5, 'Martin Sheen', 'United States', '1940-08-03', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 6, 'Harrison Ford', 'United States', '1942-07-13', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 7, 'George Lucas', 'United States', '1944-05-14', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 8, 'Gary Kurtz', 'United States', '1940-07-27', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 9, 'Steven Spielberg', 'United States', '1946-12-18', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (10, 'John Williams', 'United States', '1928-08-08', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (11, 'Tom Hanks', 'United States', '1956-07-09', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (12, 'Catherine Zeta-Jones', 'Wales', '1969-09-25', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (13, 'Alfred Joseph Hitchcock', 'United Kingdom', '1899-08-13', '1980-04-29', NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (14, 'Anthony Perkins', 'United States', '1934-04-04', '1992-09-08', NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (15, 'Vera Miles', 'United States', '1929-08-23', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (16, 'Emilio Martinez Lazaro', 'Spain', '1956-09-09', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (17, 'Dani Rovira', 'Spain', '1984-07-01', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (18, 'Clara Lago', 'Spain', '1986-04-17', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (19, 'Carmen Machi', 'Spain', '1964-08-09', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (20, 'Karra Elejalde', 'Spain', '1960-03-06', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (21, 'Daniel Sanchez Arevalo', 'Spain', '1970-06-08', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (22, 'Quim Gutierrez', 'Spain', '1981-03-27', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (23, 'Robert Alamo', 'Spain', '1970-05-06', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (24, 'Hector Colome', 'Spain', '1944-10-25', '2015-02-28', NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (25, 'Veronica Echegui', 'Spain', '1983-03-14', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (26, 'Patrick Criado', 'Spain', '1995-09-23', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (27, 'Sean Connery', 'Scotland', '1930-07-08', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (28, 'Mel Gibson', 'Australia', '1950-08-09', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (29, 'Morgan Freeman', 'United States', '1935-10-01', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (30, 'Tim Robbins', 'United States', '1949-06-07', NULL, NULL)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (41, 'Charlie Sheen', 'United States', '1965-09-03', NULL, 5)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (42, 'Emilio Estevez', 'United States', '1962-05-12', NULL, 5)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (43, 'Ramón Estevez', 'United States', '1963-08-07', NULL, 5)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (44, 'Reneé Estevez', 'United States', '1967-04-02', NULL, 5)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (45, 'Paula Speert Sheen', 'United States', '1986-01-06', NULL,41)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (46, 'Bob Sheen', 'United States', '2009-05-01', NULL,41)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (47, 'Max Sheen', 'United States', '2009-05-01', NULL,41)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (48, 'Sam Sheen', 'United States', '2004-03-09', NULL,41)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (49, 'Lola Sheen', 'United States', '2005-06-01', NULL,41)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (50, 'Paula Jones-Sheen', 'United States', '2003-07-06', NULL,45)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (51, 'Paloma Rae Estevez', 'United States', '1986-02-15', NULL,42)")
mycursor.execute("INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (52, 'Taylor Levi Estevez', 'United States', '1984-06-22', NULL,42)")

In [80]:
mycursor.execute("SELECT * FROM movies.tb_person")
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 'Francis Ford Coppola', 'United States', datetime.date(1939, 4, 7), None, None, 'OS_SGAD', None, None)
(2, 'Carmine Coppola', 'United States', datetime.date(1945, 7, 8), None, None, 'OS_SGAD', None, None)
(3, 'Marlon Brando', 'United States', datetime.date(1924, 4, 3), datetime.date(2004, 7, 1), None, 'OS_SGAD', None, None)
(4, 'Robert Duvall', 'United States', datetime.date(1931, 1, 5), None, None, 'OS_SGAD', None, None)
(5, 'Martin Sheen', 'United States', datetime.date(1940, 8, 3), None, None, 'OS_SGAD', None, None)
(6, 'Harrison Ford', 'United States', datetime.date(1942, 7, 13), None, None, 'OS_SGAD', None, None)
(7, 'George Lucas', 'United States', datetime.date(1944, 5, 14), None, None, 'OS_SGAD', None, None)
(8, 'Gary Kurtz', 'United States', datetime.date(1940, 7, 27), None, None, 'OS_SGAD', None, None)
(9, 'Steven Spielberg', 'United States', datetime.date(1946, 12, 18), None, None, 'OS_SGAD', None, None)
(10, 'John Williams', 'United States', datetime.date(1928, 8, 8), None, None, 'OS_SGAD', None, None)
(11, 'Tom Hanks', 'United States', datetime.date(1956, 7, 9), None, None, 'OS_SGAD', None, None)
(12, 'Catherine Zeta-Jones', 'Wales', datetime.date(1969, 9, 25), None, None, 'OS_SGAD', None, None)
(13, 'Alfred Joseph Hitchcock', 'United Kingdom', datetime.date(1899, 8, 13), datetime.date(1980, 4, 29), None, 'OS_SGAD', None, None)
(14, 'Anthony Perkins', 'United States', datetime.date(1934, 4, 4), datetime.date(1992, 9, 8), None, 'OS_SGAD', None, None)
(15, 'Vera Miles', 'United States', datetime.date(1929, 8, 23), None, None, 'OS_SGAD', None, None)
(16, 'Emilio Martinez Lazaro', 'Spain', datetime.date(1956, 9, 9), None, None, 'OS_SGAD', None, None)
(17, 'Dani Rovira', 'Spain', datetime.date(1984, 7, 1), None, None, 'OS_SGAD', None, None)
(18, 'Clara Lago', 'Spain', datetime.date(1986, 4, 17), None, None, 'OS_SGAD', None, None)
(19, 'Carmen Machi', 'Spain', datetime.date(1964, 8, 9), None, None, 'OS_SGAD', None, None)
(20, 'Karra Elejalde', 'Spain', datetime.date(1960, 3, 6), None, None, 'OS_SGAD', None, None)
(21, 'Daniel Sanchez Arevalo', 'Spain', datetime.date(1970, 6, 8), None, None, 'OS_SGAD', None, None)
(22, 'Quim Gutierrez', 'Spain', datetime.date(1981, 3, 27), None, None, 'OS_SGAD', None, None)
(23, 'Robert Alamo', 'Spain', datetime.date(1970, 5, 6), None, None, 'OS_SGAD', None, None)
(24, 'Hector Colome', 'Spain', datetime.date(1944, 10, 25), datetime.date(2015, 2, 28), None, 'OS_SGAD', None, None)
(25, 'Veronica Echegui', 'Spain', datetime.date(1983, 3, 14), None, None, 'OS_SGAD', None, None)
(26, 'Patrick Criado', 'Spain', datetime.date(1995, 9, 23), None, None, 'OS_SGAD', None, None)
(27, 'Sean Connery', 'Scotland', datetime.date(1930, 7, 8), None, None, 'OS_SGAD', None, None)
(28, 'Mel Gibson', 'Australia', datetime.date(1950, 8, 9), None, None, 'OS_SGAD', None, None)
(29, 'Morgan Freeman', 'United States', datetime.date(1935, 10, 1), None, None, 'OS_SGAD', None, None)
(30, 'Tim Robbins', 'United States', datetime.date(1949, 6, 7), None, None, 'OS_SGAD', None, None)
(41, 'Charlie Sheen', 'United States', datetime.date(1965, 9, 3), None, 5, 'OS_SGAD', None, None)
(42, 'Emilio Estevez', 'United States', datetime.date(1962, 5, 12), None, 5, 'OS_SGAD', None, None)
(43, 'Ramón Estevez', 'United States', datetime.date(1963, 8, 7), None, 5, 'OS_SGAD', None, None)
(44, 'Reneé Estevez', 'United States', datetime.date(1967, 4, 2), None, 5, 'OS_SGAD', None, None)
(45, 'Paula Speert Sheen', 'United States', datetime.date(1986, 1, 6), None, 41, 'OS_SGAD', None, None)
(46, 'Bob Sheen', 'United States', datetime.date(2009, 5, 1), None, 41, 'OS_SGAD', None, None)
(47, 'Max Sheen', 'United States', datetime.date(2009, 5, 1), None, 41, 'OS_SGAD', None, None)
(48, 'Sam Sheen', 'United States', datetime.date(2004, 3, 9), None, 41, 'OS_SGAD', None, None)
(49, 'Lola Sheen', 'United States', datetime.date(2005, 6, 1), None, 41, 'OS_SGAD', None, None)
(50, 'Paula Jones-Sheen', 'United States', datetime.date(2003, 7, 6), None, 45, 'OS_SGAD', None, None)
(51, 'Paloma Rae Estevez', 'United States', datetime.date(1986, 2, 15), None, 42, 'OS_SGAD', None, None)
(52, 'Taylor Levi Estevez', 'United States', datetime.date(1984, 6, 22), None, 42, 'OS_SGAD', None, None)

In [81]:
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 2, 'Y')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 3, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 5, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 2, 5, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 3, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 4, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 5, 1, 'Y')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1,41, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 6, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 6, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 7, 2, 'Y')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 8, 3, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 6, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 7, 4, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 9, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3,10, 5, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4, 9, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4, 9, 3, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4,11, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4,12, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 5, 9, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 6, 9, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 3, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,14, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,15, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 7, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,16, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,16, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,17, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,18, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,19, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,20, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,17, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,18, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,19, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,20, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (10,16, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,21, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,21, 4, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,22, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,23, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,24, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,25, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,26, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (13,28, 1, 'Y')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (13,28, 2, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (14,29, 1, 'N')")
mycursor.execute("INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (14,30, 1, 'N')")

In [82]:
mycursor.execute("SELECT * FROM movies.tb_movie_person")
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 1, 2, 'Y', 'OS_SGAD', None, None)
(1, 1, 3, 'N', 'OS_SGAD', None, None)
(1, 1, 5, 'N', 'OS_SGAD', None, None)
(1, 2, 5, 'N', 'OS_SGAD', None, None)
(1, 3, 1, 'N', 'OS_SGAD', None, None)
(1, 4, 1, 'N', 'OS_SGAD', None, None)
(1, 5, 1, 'Y', 'OS_SGAD', None, None)
(1, 6, 1, 'N', 'OS_SGAD', None, None)
(1, 41, 1, 'N', 'OS_SGAD', None, None)
(2, 6, 1, 'N', 'OS_SGAD', None, None)
(2, 7, 2, 'Y', 'OS_SGAD', None, None)
(2, 8, 3, 'N', 'OS_SGAD', None, None)
(3, 6, 1, 'N', 'OS_SGAD', None, None)
(3, 7, 1, 'N', 'OS_SGAD', None, None)
(3, 7, 4, 'N', 'OS_SGAD', None, None)
(3, 9, 2, 'N', 'OS_SGAD', None, None)
(3, 10, 5, 'N', 'OS_SGAD', None, None)
(4, 9, 2, 'N', 'OS_SGAD', None, None)
(4, 9, 3, 'N', 'OS_SGAD', None, None)
(4, 11, 1, 'N', 'OS_SGAD', None, None)
(4, 12, 1, 'N', 'OS_SGAD', None, None)
(5, 9, 2, 'N', 'OS_SGAD', None, None)
(6, 9, 2, 'N', 'OS_SGAD', None, None)
(7, 13, 1, 'N', 'OS_SGAD', None, None)
(7, 13, 2, 'N', 'OS_SGAD', None, None)
(7, 13, 3, 'N', 'OS_SGAD', None, None)
(7, 14, 2, 'N', 'OS_SGAD', None, None)
(7, 15, 2, 'N', 'OS_SGAD', None, None)
(8, 16, 2, 'N', 'OS_SGAD', None, None)
(8, 17, 1, 'N', 'OS_SGAD', None, None)
(8, 18, 1, 'N', 'OS_SGAD', None, None)
(8, 19, 1, 'N', 'OS_SGAD', None, None)
(8, 20, 1, 'N', 'OS_SGAD', None, None)
(9, 16, 2, 'N', 'OS_SGAD', None, None)
(9, 17, 1, 'N', 'OS_SGAD', None, None)
(9, 18, 1, 'N', 'OS_SGAD', None, None)
(9, 19, 1, 'N', 'OS_SGAD', None, None)
(9, 20, 1, 'N', 'OS_SGAD', None, None)
(10, 16, 2, 'N', 'OS_SGAD', None, None)
(11, 21, 2, 'N', 'OS_SGAD', None, None)
(11, 21, 4, 'N', 'OS_SGAD', None, None)
(11, 22, 1, 'N', 'OS_SGAD', None, None)
(11, 23, 1, 'N', 'OS_SGAD', None, None)
(11, 24, 1, 'N', 'OS_SGAD', None, None)
(11, 25, 1, 'N', 'OS_SGAD', None, None)
(11, 26, 1, 'N', 'OS_SGAD', None, None)
(13, 28, 1, 'Y', 'OS_SGAD', None, None)
(13, 28, 2, 'N', 'OS_SGAD', None, None)
(14, 29, 1, 'N', 'OS_SGAD', None, None)
(14, 30, 1, 'N', 'OS_SGAD', None, None)

In [ ]:
mycursor.execute("DESCRIBE movies.tb_movie_person")

In [90]:
indexList = mycursor.fetchall()

print(indexList)

[('movie_id', b'int', 'NO', 'PRI', None, ''), ('person_id', b'int', 'NO', 'PRI', None, ''), ('role_id', b'int', 'NO', 'PRI', None, ''), ('movie_award_ind', b'char(1)', 'NO', '', None, ''), ('created_by_user', b'varchar(10)', 'NO', '', b'OS_SGAD', ''), ('created_date', b'date', 'YES', '', None, ''), ('updated_date', b'date', 'YES', '', None, '')]

In [93]:
mycursor.execute("SHOW COLUMNS FROM movies.tb_movie_person")

In [94]:
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('movie_id', b'int', 'NO', 'PRI', None, '')
('person_id', b'int', 'NO', 'PRI', None, '')
('role_id', b'int', 'NO', 'PRI', None, '')
('movie_award_ind', b'char(1)', 'NO', '', None, '')
('created_by_user', b'varchar(10)', 'NO', '', b'OS_SGAD', '')
('created_date', b'date', 'YES', '', None, '')
('updated_date', b'date', 'YES', '', None, '')

In [ ]:
# - Exercici 2:

Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir el nom, el país i la data de naixement d'aquelles persones per les quals no consti una data de mort i ordenar les dades de la persona més vella a la persona més jove.

In [96]:
mycursor.execute("SELECT person_name, person_country, person_dob FROM movies.tb_person WHERE person_dod IS NULL ORDER BY person_dob")

In [97]:
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John Williams', 'United States', datetime.date(1928, 8, 8))
('Vera Miles', 'United States', datetime.date(1929, 8, 23))
('Sean Connery', 'Scotland', datetime.date(1930, 7, 8))
('Robert Duvall', 'United States', datetime.date(1931, 1, 5))
('Morgan Freeman', 'United States', datetime.date(1935, 10, 1))
('Francis Ford Coppola', 'United States', datetime.date(1939, 4, 7))
('Gary Kurtz', 'United States', datetime.date(1940, 7, 27))
('Martin Sheen', 'United States', datetime.date(1940, 8, 3))
('Harrison Ford', 'United States', datetime.date(1942, 7, 13))
('George Lucas', 'United States', datetime.date(1944, 5, 14))
('Carmine Coppola', 'United States', datetime.date(1945, 7, 8))
('Steven Spielberg', 'United States', datetime.date(1946, 12, 18))
('Tim Robbins', 'United States', datetime.date(1949, 6, 7))
('Mel Gibson', 'Australia', datetime.date(1950, 8, 9))
('Tom Hanks', 'United States', datetime.date(1956, 7, 9))
('Emilio Martinez Lazaro', 'Spain', datetime.date(1956, 9, 9))
('Karra Elejalde', 'Spain', datetime.date(1960, 3, 6))
('Emilio Estevez', 'United States', datetime.date(1962, 5, 12))
('Ramón Estevez', 'United States', datetime.date(1963, 8, 7))
('Carmen Machi', 'Spain', datetime.date(1964, 8, 9))
('Charlie Sheen', 'United States', datetime.date(1965, 9, 3))
('Reneé Estevez', 'United States', datetime.date(1967, 4, 2))
('Catherine Zeta-Jones', 'Wales', datetime.date(1969, 9, 25))
('Robert Alamo', 'Spain', datetime.date(1970, 5, 6))
('Daniel Sanchez Arevalo', 'Spain', datetime.date(1970, 6, 8))
('Quim Gutierrez', 'Spain', datetime.date(1981, 3, 27))
('Veronica Echegui', 'Spain', datetime.date(1983, 3, 14))
('Taylor Levi Estevez', 'United States', datetime.date(1984, 6, 22))
('Dani Rovira', 'Spain', datetime.date(1984, 7, 1))
('Paula Speert Sheen', 'United States', datetime.date(1986, 1, 6))
('Paloma Rae Estevez', 'United States', datetime.date(1986, 2, 15))
('Clara Lago', 'Spain', datetime.date(1986, 4, 17))
('Patrick Criado', 'Spain', datetime.date(1995, 9, 23))
('Paula Jones-Sheen', 'United States', datetime.date(2003, 7, 6))
('Sam Sheen', 'United States', datetime.date(2004, 3, 9))
('Lola Sheen', 'United States', datetime.date(2005, 6, 1))
('Bob Sheen', 'United States', datetime.date(2009, 5, 1))
('Max Sheen', 'United States', datetime.date(2009, 5, 1))

# - Exercici 3:

Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir el nom del gènere i el nombre total de pel·lícules d'aquest gènere i ordenar-ho per ordre descendent de nombre total de pel·lícules.

In [102]:
mycursor.execute("SELECT movie_genre_id, COUNT(*) FROM movies.tb_movie GROUP BY movie_genre_id")

In [107]:
mycursor.execute("SELECT Cantidad, COUNT(*) FROM (SELECT movie_genre_id, COUNT(*) FROM movies.tb_movie GROUP BY movie_genre_id ) GROUP BY Cantidad")

ProgrammingError: 1248 (42000): Every derived table must have its own alias

In [103]:
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 2)
(2, 2)
(3, 3)
(4, 2)
(5, 1)
(8, 2)
(9, 2)
(10, 1)
(11, 1)